{
  "backend/main.mo": "Defines the main persistent actor for products, orders, user profiles, referrals, and marketplace settings with authorization and blob‑storage mixins.",
  "backend/migration.mo": "Provides migration logic converting old stored actor state to the new schema including contactInfo, email, promo fields, and expanded profiles.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for many frontend source files and their responsibilities.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures the TanStack Router routes and wraps the app with theming, cart provider, and toast notifications.",
  "frontend/src/cart/CartContext.tsx": "Provides cart state with add, remove, update, clear, and total calculation persisted in session storage.",
  "frontend/src/cart/cartTypes.ts": "Defines the CartItem type with product details, variants, quantity, and image URL.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with options to return home or sign in.",
  "frontend/src/components/auth/LoginButton.tsx": "Shows a logout button for authenticated users and handles logout with loading state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog prompting users to complete their profile and submit required fields.",
  "frontend/src/components/auth/ProtectedRoute.tsx": "Guards routes by checking authentication and optional admin access, showing loading or denial screens as needed.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, and routed content area.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with copyright and a link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Displays the site header with logo, search, cart, and user menu driven by auth and settings hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, invalidating queries when it changes.",
  "frontend/src/hooks/useAdminAccess.ts": "Provides mutations for granting and revoking admin roles and refreshes admin status.",
  "frontend/src/hooks/useAdminProducts.ts": "Implements product CRUD mutations using the actor and invalidates product-related queries.",
  "frontend/src/hooks/useAuthActions.ts": "Wraps login and logout logic for Internet Identity with error handling and cache clearing.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and updates the caller's user profile and admin status via actor queries.",
  "frontend/src/hooks/useFounderAccess.ts": "Provides a mutation to verify a founder email and refresh admin-related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Creates and manages Internet Identity auth state, providing login, logout, and identity context.",
  "frontend/src/hooks/useMarketplaceSettings.ts": "Exposes queries and mutations for fetching and updating marketplace settings like name, tagline, and logo.",
  "frontend/src/hooks/useOrders.ts": "Provides hooks to create orders and fetch user orders or specific order details.",
  "frontend/src/hooks/useProducts.ts": "Supplies queries for fetching all products or a single product by ID.",
  "frontend/src/hooks/useReferral.ts": "Handles referral code creation, application, and retrieval of referral summary.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for theming including light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AccountPage.tsx": "Renders the account page allowing users to view, copy, and apply referral codes, plus see referral stats.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin interface for managing products, marketplace settings, and admin roles, including delete actions and form inputs.",
  "frontend/src/pages/admin/ProductEditorPage.tsx": "Product creation/editing form supporting images, sizes, colors, validation, and saving via admin API hooks.",
  "frontend/src/pages/AuthEntryPage.tsx": "Provides login entry options for customers, sellers, and founders with related access checks and navigation.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls, calculates totals, and shows empty-cart state with navigation back to shopping.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout form, promo codes, order submission, and profile setup prompts before creating an order.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows a success message and detailed summary of a completed order including items and contact info.",
  "frontend/src/pages/OrderDetailPage.tsx": "Displays full details of a specific order, including items, status, and contact information, with navigation back to orders.",
  "frontend/src/pages/OrdersPage.tsx": "Lists the user's past orders with status indicators and allows navigation to individual order details.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays a single product with size/color selection and add-to-cart logic, handling loading, missing products, and profile setup prompts.",
  "frontend/src/pages/StorefrontPage.tsx": "Shows a product grid with search, price filtering, and size-based filtering, using local state and memoized filters.",
  "frontend/src/utils/images.ts": "Provides utilities to convert blobs and files to image URLs or Uint8Array for uploads.",
  "frontend/src/utils/money.ts": "Formats prices from cents to rupees and converts cents to numeric rupee values.",
  "frontend/src/utils/promoCodes.ts": "Validates fixed promo codes and computes a 50% discount when applicable.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL parameters, persist them in sessionStorage, and manage hash-based query values.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, requirements, architectural notes, known issues, and existing features for an e‑commerce T‑shirt marketplace."
}