{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Checkout email + promo discount, robust II auth, role-based entry points, founder recognition, and admin publishing info",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Collect buyer email during checkout and display it in order confirmation/details.",
      "acceptanceCriteria": [
        "Checkout page shows a required Email field with clear validation messaging in English.",
        "When an order is placed, the submitted order payload includes the email value.",
        "Order confirmation and order detail views display the email value (or clearly show it as part of the shipping/contact information)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Add a required Email field (with English validation messaging) to checkout form state and submit it as part of order contact info. Ensure the UI treats email as required alongside full name/phone/address."
        },
        {
          "path": "frontend/src/hooks/useOrders.ts",
          "operation": "modify",
          "description": "Update the create-order mutation to send a ContactInfo object (including email + shipping address) matching the current backend interface. Ensure the mutation input type and call signature include email so placed orders persist it."
        },
        {
          "path": "frontend/src/pages/OrderConfirmationPage.tsx",
          "operation": "modify",
          "description": "Update the confirmation view to read email from order.contactInfo.email and display it clearly under contact/shipping information (English labels)."
        },
        {
          "path": "frontend/src/pages/OrderDetailPage.tsx",
          "operation": "modify",
          "description": "Update the order detail view to read email from order.contactInfo.email and display it clearly under contact/shipping information (English labels)."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Add optional promo code entry at checkout with 50% discount when code is allowlisted, with clear UI feedback.",
      "acceptanceCriteria": [
        "Checkout page includes an optional field labeled in English (e.g., \"Promo code (optional)\").",
        "If the code matches the allowlist, the order summary clearly shows the discount amount and the final total (50% off the pre-discount total).",
        "If the code is invalid, the UI shows a clear English error and no discount is applied.",
        "The backend computes and stores the discounted order total so that refreshing the UI or viewing order history does not lose the discount.",
        "If no code is provided, totals match the current behavior (no discount)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/promoCodes.ts",
          "operation": "create",
          "description": "Add a small helper module that contains the allowlisted promo/referral codes and a validation function used by checkout UI (no backend secrets)."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Add an optional \"Promo code (optional)\" field and client-side allowlist validation. Update the order summary to show (a) pre-discount total, (b) discount line when valid (50% off), and (c) final total. Show a clear English error when invalid and apply no discount in the UI."
        },
        {
          "path": "frontend/src/hooks/useOrders.ts",
          "operation": "modify",
          "description": "Extend the create-order mutation input to include an optional promoCode (string | null) and pass it through to the backend createOrder call so totals remain consistent across refresh/order history."
        },
        {
          "path": "frontend/src/pages/OrderConfirmationPage.tsx",
          "operation": "modify",
          "description": "Display whether a promo was applied using order.promoApplied / order.promoCode, and ensure totals shown reflect order.totalCents computed by the backend (with clear English labels)."
        },
        {
          "path": "frontend/src/pages/OrderDetailPage.tsx",
          "operation": "modify",
          "description": "Display promo application status (and promo code if present) and ensure totals reflect order.totalCents from the backend (with clear English labels)."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Make Internet Identity login/logout resilient (no stuck \"already authenticated\" errors; no manual refresh required).",
      "acceptanceCriteria": [
        "Clicking the Login button reliably completes login and updates the UI to the signed-in state.",
        "Clicking Logout reliably clears the identity and updates the UI to the signed-out state.",
        "If a user is already authenticated, clicking Login does not leave the app in a broken state; it should recover gracefully and end in a signed-in state.",
        "All login/logout user-facing messages shown in the UI are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuthActions.ts",
          "operation": "create",
          "description": "Create a small wrapper hook that composes Internet Identity actions into robust login/logout helpers: handle \"User is already authenticated\" by clearing then retrying login; on logout, clear React Query cache and any auth-related UI state. Use the authorization component guidance for clearing cached personal data after logout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Refactor LoginButton to use the new auth action wrapper so login/logout always ends in a consistent state. Ensure any user-facing errors/toasts/messages are in English and the \"already authenticated\" case recovers gracefully. Use the authorization component guidance for clearing cached application data on logout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Ensure the signed-in/signed-out UI updates reliably after auth state changes (e.g., avoid rendering stale user/admin menu state). Use the authorization component guidance for role-based UI display (admin menu visibility) and English text. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Provide separate buyer vs seller login entry points (both via Internet Identity) with admin routing and access-denied handling.",
      "acceptanceCriteria": [
        "The UI provides two clear options in English (e.g., \"Customer Login\" and \"Seller Login\").",
        "Both options authenticate via Internet Identity (no email/password login is introduced).",
        "After login via Seller Login: if the user has admin access, they are navigated to /admin; if not, they see an English access-denied message with a way back to the storefront.",
        "After login via Customer Login: the user is navigated to the storefront (/) or their intended buyer flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AuthEntryPage.tsx",
          "operation": "create",
          "description": "Create an auth entry page that presents clear English options: \"Customer Login\" and \"Seller Login\" (and links into the existing Internet Identity flow). After authentication, route customers to the storefront and sellers to /admin only if admin; otherwise show an English access-denied message with navigation back to the storefront. Use the authorization component patterns for role checks and AccessDenied-style UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new auth entry page into the router (e.g., /auth) so it is navigable and not orphaned."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Update the signed-out header UI to expose the two entry points (e.g., a \"Sign in\" action that navigates to /auth or a small menu listing Customer Login and Seller Login). Keep all new text in English. Use authorization component guidance for role-based UI where needed. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Ensure AccessDeniedScreen copy is clear in English for the seller-not-admin scenario and includes an obvious way back to the storefront (reuse existing navigation patterns). Use authorization component guidance for access-denied UI. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add founder recognition using the exact founder email to grant highest access (admin) within the existing role system.",
      "acceptanceCriteria": [
        "There is a clear English UI path for \"Founder Login\" (or an equivalent founder verification step after login).",
        "The founder email value used for matching is exactly \"mercutiose369@gmail.com\".",
        "After successful founder recognition, the user has admin-level access in the app (e.g., can access /admin without AccessDenied).",
        "If a non-matching email is provided, the user is not granted founder/admin access and receives a clear English error message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useFounderAccess.ts",
          "operation": "create",
          "description": "Add a hook that verifies founder email (exact match to \"mercutiose369@gmail.com\" and/or via backend isFounderEmail) and, on success, triggers the existing role/admin refresh flow so the UI recognizes admin access. Use authorization component guidance for role-based access and cache invalidation after role changes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/AuthEntryPage.tsx",
          "operation": "modify",
          "description": "Add a clear English \"Founder Login\" path (or founder verification step) that prompts for the founder email and runs founder verification. On success, navigate to /admin; on failure, show a clear English error and keep the user in a non-admin state. Use authorization component patterns for admin gating and error handling. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Ensure the header reflects founder/admin access after successful founder recognition (e.g., admin menu appears and seller flow routes correctly). Use authorization component guidance for role-based UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/ProtectedRoute.tsx",
          "operation": "modify",
          "description": "Improve admin gating UX for newly elevated founder accounts by ensuring admin checks refresh promptly and show an English loading state while admin status is being determined. Use authorization component guidance for role-based access control UI. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add an in-app admin Publishing/Deploy section explaining auto-deploy behavior and providing a copyable live URL.",
      "acceptanceCriteria": [
        "Admin UI includes a \"Deploy\" or \"Publishing\" section/tab/page with English explanatory text stating updates deploy automatically after changes.",
        "The section provides a convenient action such as \"Copy live app link\" (or equivalent) that works in the browser.",
        "No UI claims to perform an on-demand deployment if the platform cannot actually do so."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add a new admin tab/section (e.g., \"Publishing\") that explains in English that updates deploy automatically after changes. Include a browser-safe \"Copy live app link\" action (using the current location origin) with success/error feedback in English. Use the authorization component patterns for admin-only UI (ProtectedRoute requireAdmin) already used by /admin. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}