{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-15T06:34:39.770Z",
  "summary": "Diff implements the new /auth entry page with Customer/Seller/Founder paths, improves II login/logout handling, adds checkout email + promo code UI logic, and updates order/contact types to include email and promo fields. However, the diff summary does not provide evidence that the backend actually (a) applies/stores the 50% promo discount in totalCents, (b) exposes the updated createOrder signature and returns the stored promo/email reliably, or (c) supports founder recognition via an isFounderEmail API. Evidence for the required Admin 'Deploy/Publishing' explanatory section and live-link copy action is also inconclusive due to truncation.",
  "missing_requirements": [
    {
      "id": "REQ-19",
      "requirement": "Backend computes and stores the discounted order total (50% off) when an allowlisted promo code is provided, so order history/refresh preserves the discount.",
      "reason": "Frontend calculates and displays discount client-side and passes promoCode to createOrder, but the diff summary does not show backend logic that validates allowlisted codes and persists discounted totalCents (or any allowlist enforcement) during order creation.",
      "evidence": [
        "frontend/src/pages/CheckoutPage.tsx",
        "frontend/src/utils/promoCodes.ts",
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-20",
      "requirement": "Extend backend order creation API to accept contact email + optional promo code and compute discounted totalCents; ensure getOrder/getMyOrders include stored email.",
      "reason": "Order types were extended to include contactInfo.email and promoCode/promoApplied, but the diff summary is truncated before showing createOrder implementation/signature changes and discount computation; cannot confirm API behavior or compilation success from the summary alone.",
      "evidence": [
        "backend/main.mo (truncated)",
        "backend/migration.mo (truncated)",
        "frontend/src/hooks/useOrders.ts"
      ]
    },
    {
      "id": "REQ-23",
      "requirement": "Founder login recognition for email \"mercutiose369@gmail.com\" that grants highest access level (admin) within the existing role system.",
      "reason": "Frontend calls actor.isFounderEmail(email) and then expects admin status to change, but the diff summary does not show any backend method isFounderEmail nor any backend role elevation tied to founder email verification.",
      "evidence": [
        "frontend/src/hooks/useFounderAccess.ts",
        "backend/main.mo (truncated)"
      ]
    },
    {
      "id": "REQ-24",
      "requirement": "Admin UI includes a 'Deploy' or 'Publishing' section with English explanatory text that updates deploy automatically, plus a working 'Copy live app link' (or equivalent) action; no claim of on-demand deployment.",
      "reason": "AdminDashboardPage diff is truncated; while there are hints (linkCopied state, Copy/Rocket icons), the summary does not show the actual Deploy/Publishing section, explanatory text, or a clipboard copy implementation and wording constraints.",
      "evidence": [
        "frontend/src/pages/admin/AdminDashboardPage.tsx (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Profile setup dialog requiring users to enter name/email/phone on first login and backend user profile model extended with email/phone/address.",
      "reason": "BuildRequest did not ask for a mandatory user profile onboarding flow or expanding/storing user profile contact fields beyond checkout email collection and founder recognition.",
      "evidence": [
        "frontend/src/components/auth/ProfileSetupDialog.tsx",
        "backend/main.mo (truncated)",
        "backend/migration.mo (truncated)"
      ]
    }
  ],
  "confidence": 0.63,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/App.tsx",
    "frontend/src/components/auth/AccessDeniedScreen.tsx",
    "frontend/src/components/auth/LoginButton.tsx",
    "frontend/src/components/auth/ProfileSetupDialog.tsx",
    "frontend/src/components/auth/ProtectedRoute.tsx",
    "frontend/src/components/layout/Header.tsx",
    "frontend/src/hooks/useAuthActions.ts",
    "frontend/src/hooks/useFounderAccess.ts",
    "frontend/src/hooks/useOrders.ts",
    "frontend/src/pages/AuthEntryPage.tsx",
    "frontend/src/pages/CheckoutPage.tsx",
    "frontend/src/pages/OrderConfirmationPage.tsx",
    "frontend/src/pages/OrderDetailPage.tsx",
    "frontend/src/pages/OrdersPage.tsx",
    "frontend/src/pages/admin/AdminDashboardPage.tsx",
    "frontend/src/utils/promoCodes.ts",
    "project_state.json"
  ]
}